# Блок №2

# Задание 1
___
Начнем с простого вопроса: что произойдет в результате выполнения следующей команды?
```
import pandas as pnds
```

Ответ:
```
Сможем использовать библиотеку pandas, обращаясь к ней как pnds
```

# Задание 2
___
Теперь поработаем с [данными](https://disk.yandex.ru/d/IlGBG73JfIYdDg) о поездках на такси в Нью-Йорке, где также имеется информация о погодных условиях и выходных днях.  

+ pickup_dt – период с точностью до часа
+ pickup_month – месяц
+ borough – район Нью-Йорка, из которого был сделан заказ (5 районов + аэропорт)
+ pickups – число поездок за период (час)
+ hday – является ли день праздничным/выходным; Y - да,  N - нет
+ spd – скорость ветра в милях в час
+ vsb – видимость
+ temp – температура в градусах Фаренгейта
+ dewp – точка росы по Фаренгейту
+ slp – давление
+ pcp_01 – количество осадков за час
+ pcp_06 – количество осадков за 6 часов
+ pcp_24 – количество осадков за 24 часа
+ sd – глубина снега в дюймах
      

Но перед тем, как приступать к работе, давайте загрузим данные. Предположим, что данные лежат в переменной `path_to_file` (path_to_file = "/some/path/to/file.csv"). Импортируйте библиотеку `pandas`, а затем загрузите данные по вышеупомянутой ссылке. 

Результат сохраните в переменную `taxi`.

In [4]:
import pandas as pd

In [5]:
path_to_file = '/home/jupyter-a.stamati-16/Lectures_2/2_taxi_nyc.csv'

In [6]:
taxi = pd.read_csv(path_to_file)

In [7]:
# Посмотрим на полученные данные
taxi.head()

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

# Задание 3
___
Проверьте, сколько всего строк и столбцов имеется в датасете.

In [8]:
taxi.shape

(29101, 14)

Ответ:
```
29101 строка, 14 столбцов
```

# Задание 4
___
Давайте посмотрим на типы колонок. Все ли из них считались правильно? В качестве ответа выберите тип, преобладающий в датасете.

In [11]:
taxi.dtypes.value_counts()

float64    9
object     4
int64      1
dtype: int64

Ответ: float64

# Задание 5
___
В названиях столбцов `pcp 01`, `pcp 06`, `pcp 24` встречается пробел. Это не очень удобно, если в дальнейшем вы планируете обращаться к колонкам через точку, без использования кавычек и скобочек. 

Замените пробел в названиях на знак нижнего подчеркивания.

In [12]:
# Применим lambda-функцию для переименования колонок
taxi = taxi.rename(columns= lambda x: x.replace(' ', '_'))

In [13]:
# Посмотрим на получившийся результат
taxi.head()

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

# Задание 6
___
Вас попросили узнать, сколько записей (строк) в датафрейме относятся к району Манхэттен (Manhattan). Получить ответ на данный вопрос можно было бы, например, с помощью следующей команды:
```
taxi.query("borough == 'Manhattan'").shape[0]
```
А если мы хотим посмотреть, сколько раз встречается каждый из районов? Неужели придется использовать подобную конструкцию для каждого уровня переменной? Здесь на помощь приходит метод `value_counts()`. 

Сколько раз в данных встречается район Бруклин (Brooklyn)?

In [14]:
# Выберем колонку borough, в которой хранится название района
# Затем применим value_counts() и посмотрим на получившийся результат
taxi.borough.value_counts()

Staten Island    4343
Queens           4343
EWR              4343
Bronx            4343
Brooklyn         4343
Manhattan        4343
Name: borough, dtype: int64

Ответ на задание:

In [15]:
taxi.borough.value_counts().loc['Brooklyn']

4343

# Задание 7
___
Следующая задача: выяснить, из какого района было совершено наибольшее количество поездок за весь период. 

Для начала, посчитайте общее количество поездок (pickups), без группировки.

In [16]:
taxi.pickups.sum()

14265773

# Задание 8
___
А теперь сгруппируйте данные по району (`borough`) и укажите, из какого пункта было совершено больше всего поездок.

In [47]:
# Сгруппируем и агрегируем данные, затем по полученной таблице выберем ответ
taxi.groupby('borough', as_index=False).agg({'pickups': 'sum'})

         borough   pickups
0          Bronx    220047
1       Brooklyn   2321035
2            EWR       105
3      Manhattan  10367841
4         Queens   1343528
5  Staten Island      6957

Ответ:
```
Manhattan
```

In [48]:
# Способ получить всю строку с максимальным значением в столбце
taxi_per_borough = taxi.groupby('borough', as_index=False) \
                        .agg({'pickups': 'sum'})
taxi_per_borough.loc[taxi_per_borough['pickups'].idxmax()]
# Получим интересующее нас значение района из отобранной строки
taxi_per_borough.loc[taxi_per_borough['pickups'].idxmax()].borough

'Manhattan'

# Задание 9
___
Еще несколько полезных методов в `pandas`! Возможно, в предыдущем степе вы просто посмотрели на данные или отсортировали значения. Ускорить данный процесс в дальнейшем помогут методы `idxmin()` и `idxmax()`, которые возвращают индекс минимального или максимального значения.

+ idxmin – индекс минимального значения
+ idxmax – индекс максимального значения

Сохраните название района с наименьшим числом поездок в переменную `min_pickups`, применив подходящий метод.

In [49]:
min_pickups = taxi.groupby('borough').agg({'pickups': 'sum'}).idxmin().pickups

In [50]:
min_pickups

'EWR'

# Задание 10
___
Продолжим изучение данных и посмотрим на число поездок в выходные дни. Сгруппируйте данные по двум признакам: району города и является ли день выходным (колонки `borough` и `hday`). Сравните среднее число поездок, и выберите районы, из которых по праздникам в среднем поступает больше заказов, чем в обычные дни.

In [51]:
# Отберем данные с выходными днями, сгруппируем и посчитаем среднее число поездок
y_day = taxi.query('hday == "Y"') \
            .groupby(['borough', 'hday'], as_index=False) \
            .agg({'pickups': 'mean'})

In [52]:
y_day

         borough hday      pickups
0          Bronx    Y    48.065868
1       Brooklyn    Y   527.011976
2            EWR    Y     0.041916
3      Manhattan    Y  2035.928144
4         Queens    Y   320.730539
5  Staten Island    Y     1.497006

In [53]:
# Отберем данные с буднями, сгруппируем и посчитаем среднее число поездок
n_day = taxi.query('hday == "N"') \
            .groupby(['borough', 'hday'], as_index=False) \
            .agg({'pickups': 'mean'})

In [54]:
n_day

         borough hday      pickups
0          Bronx    N    50.771073
1       Brooklyn    N   534.727969
2            EWR    N     0.023467
3      Manhattan    N  2401.302921
4         Queens    N   308.899904
5  Staten Island    N     1.606082

In [55]:
# Пройдемся датафремам в цикле и получим ответы
for i in range(len(y_day)):
    if y_day.pickups[i] > n_day.pickups[i]:
        print(y_day.borough[i])

EWR
Queens

# Задание 11
___
Для каждого района посчитайте число поездок по месяцам. Отсортируйте полученные значения по убыванию и сохраните результирующий датафрейм в `pickups_by_mon_bor`.

Обратите внимание, что итоговый датасет должен состоять из 3-х колонок - `pickup_month`, `borough`, `pickups`.

In [56]:
# Выполним действия, сказанные в задании
pickups_by_mon_bor = taxi \
    .groupby(['pickup_month', 'borough'], as_index=False) \
    .agg({'pickups':'sum'}) \
    .sort_values('pickups', ascending=False)

In [57]:
# Посмотрим на получившийся датафрейм
pickups_by_mon_bor.head()

   pickup_month    borough  pickups
21          Jun  Manhattan  1995388
33          May  Manhattan  1888800
9           Feb  Manhattan  1718571
27          Mar  Manhattan  1661261
3           Apr  Manhattan  1648278

# Задание 12
___
Попрактикуемся в написании собственных функций и их применении к датафрейму. Поскольку данные о поездках в Нью-Йорке, температура представлена в градусах Фаренгейта. 

Напишите функцию `temp_to_celcius`, которая получает на вход колонку с температурой в °F, и возвращает значения, переведенные в градусы Цельсия.

Формула: $Celsius = \frac{(Fahrenheit-32) \cdot 5.0}{9.0}$

Пример работы функции:
```
> taxi['temp'][:5]

0    30.0
1    30.0
3    30.0
4    30.0
5    30.0
```
```
> taxi['temp_C'] = temp_to_celcius(taxi['temp'])
> taxi['temp_C'][:5]

0   -1.111111
1   -1.111111
3   -1.111111
4   -1.111111
5   -1.111111
```

In [58]:
def temp_to_celcius(temp):
    return (temp - 32) * 5 / 9

In [59]:
taxi['temp'][:5]

0    30.0
1    30.0
2    30.0
3    30.0
4    30.0
Name: temp, dtype: float64

In [60]:
taxi['temp_C'] = temp_to_celcius(taxi['temp'])

In [61]:
taxi['temp_C'][:5]

0   -1.111111
1   -1.111111
2   -1.111111
3   -1.111111
4   -1.111111
Name: temp_C, dtype: float64